;; -*- no-byte-compile: t; -*-
;;; custom/dired/packages.el

(package! treemacs :recipe (:host github :repo "agzam/treemacs"))
(package! treemacs-evil)
;; (package! treemacs-all-the-icons)
(package! treemacs-icons-dired)
(package! treemacs-projectile)
(package! lsp-treemacs)
(package! dired-imenu)
(package! dired-subtree)
(package! dired-sidebar)
(package! dired-narrow)
