;; -*- no-byte-compile: t; -*-
;;; custom/dired/packages.el

(package! treemacs)
(package! treemacs-evil)
;; (package! treemacs-all-the-icons)
(package! treemacs-icons-dired)
(package! treemacs-projectile)
(package! lsp-treemacs)
(package! direx :recipe (:host github :repo "agzam/direx-el"))
(package! dired-imenu)
(package! dired-subtree)
